package com.company;

public class Main {

    public static void main(String[] args) {


                                                   //ПОБИТОВЫЕ ОПЕРАЦИИ


                //(ПЕРЕВОД В ДВОИЧНУЮ СИСТЕМУ)
                //System.out.println(Integer.toBinaryString(a,b));
                //int a = 42; // 101010; // -42 = 11111111111111111111111111010110;
                //int b = 15; // 1111;   // -15 = 11111111111111111111111111110001;

                //(ПЕРЕВОД В ДЕСЯТИЧНУЮ СИСТЕМУ)
                //System.out.println(Integer.parseInt("a,b", 2));

                //(ПОБИТОВОЕ NOT)(~)
                //System.out.println("42~="+~a+""+"15~="+~b);
                // ~42 = -43; 11111111111111111111111111010101; ~-42 = 41; 101001;
                // ~15 = -16; 11111111111111111111111111110000; ~-15 = 14; 1110;

                //(ПОБИТОВОЕ OR)(|)
                //System.out.println(a|b);
                //  42 |  15 =  47; 101111;
                // -42 | -15 = -9;  11111111111111111111111111110111;

                //(ПОБИТОВОЕ AND)(&)
                // System.out.println(a&b);
                //  42 &  15 =  10; 1010;
                // -42 & -15 = -48; 11111111111111111111111111010000;

                //(ПОБИТОВОЕ XOR)(^)
                //System.out.println(a^b);
                //  42 ^  15 = 37; 100101;
                // -42 ^ -15 = 39; 100111;

                //(СДВИГ ВЛЕВО)(<<)
                //System.out.println(a<<b);
                //  42 <<  15 =  1376256; 101010000000000000000;
                // -42 << -15 = -5505024; 11111111101011000000000000000000;

                //(СДВИГ ВПРАВО )(>>)
                //System.out.println(a>>b);
                //  42 >>  15 =  0; 0;
                // -42 >> -15 = -1; 11111111111111111111111111111111;

                //(СДВИГ ВПРАВО БЕЗ УЧЕТА ЗНАКА)(>>>)
                //System.out.println(a>>>b);
                //  42 >>>  15 = 0; 0;
                // -42 >>> -15 = 32767;  111111111111111;

            }
        }



